## ğŸ“‚ Pivot Table

Pivot Tableì´ë€ **ê°€ì§€ê³  ìˆëŠ” ë°ì´í„° ì›ë³¸ì„ ì›í•˜ëŠ” í˜•íƒœì˜ ê°€ê³µëœ ì •ë³´ë¡œ ë³´ì—¬ì£¼ëŠ” ê²ƒ**ì´ë©° ìë£Œì˜ í˜•íƒœë¥¼ ë³€ê²½í•˜ê¸° ìœ„í•´ ë§ì´ ì‚¬ìš©í•˜ëŠ” ë°©ë²•ì´ë‹¤.<br>
Pivot Tableì€ ë‘ ê°œì˜ í‚¤ë¥¼ ì‚¬ìš©í•´ì„œ ë°ì´í„°ë¥¼ ì„ íƒí•˜ë©° ìì„¸í•œ ì‚¬ìš©ë²•ì€ ë‹¤ìŒê³¼ ê°™ë‹¤.<br>

**pivot_table(data, index = 'í–‰ ìœ„ì¹˜ì— ë“¤ì–´ê°ˆ ì—´', columns = 'ì—´ ìœ„ì¹˜ì— ë“¤ì–´ê°ˆ ì—´, values = 'ë°ì´í„°ë¡œ ì‚¬ìš©í•  ì—´', aggfunc = 'ë°ì´í„° ì§‘ê³„í•¨ìˆ˜')**

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [3]:
data = {
    'ë„ì‹œ':['ì„œìš¸', 'ì„œìš¸', 'ì„œìš¸', 'ë¶€ì‚°', 'ë¶€ì‚°', 'ë¶€ì‚°', 'ì¸ì²œ', 'ì¸ì²œ'],
    'ì—°ë„':['2015', '2010', '2005', '2015', '2010', '2005', '2015', '2010'],
    'ì¸êµ¬':[9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    'ì§€ì—­':['ìˆ˜ë„ê¶Œ', 'ìˆ˜ë„ê¶Œ', 'ìˆ˜ë„ê¶Œ', 'ê²½ìƒê¶Œ', 'ê²½ìƒê¶Œ', 'ê²½ìƒê¶Œ', 'ìˆ˜ë„ê¶Œ', 'ìˆ˜ë„ê¶Œ']
}

columns = ['ë„ì‹œ', 'ì—°ë„', 'ì¸êµ¬', 'ì§€ì—­']
df1 = pd.DataFrame(data, columns=columns)
df1

   ë„ì‹œ    ì—°ë„       ì¸êµ¬   ì§€ì—­
0  ì„œìš¸  2015  9904312  ìˆ˜ë„ê¶Œ
1  ì„œìš¸  2010  9631482  ìˆ˜ë„ê¶Œ
2  ì„œìš¸  2005  9762546  ìˆ˜ë„ê¶Œ
3  ë¶€ì‚°  2015  3448737  ê²½ìƒê¶Œ
4  ë¶€ì‚°  2010  3393191  ê²½ìƒê¶Œ
5  ë¶€ì‚°  2005  3512547  ê²½ìƒê¶Œ
6  ì¸ì²œ  2015  2890451  ìˆ˜ë„ê¶Œ
7  ì¸ì²œ  2010   263203  ìˆ˜ë„ê¶Œ

ì•„ë˜ëŠ” ê° ë„ì‹œì— ëŒ€í•œ ì—°ë„ë³„ ì¸êµ¬ ìˆ˜ë¥¼ êµ¬í•˜ëŠ” ì˜ˆì œì´ë‹¤.

In [4]:
pd.pivot_table(df1, index='ë„ì‹œ', columns='ì—°ë„', values='ì¸êµ¬')

ì—°ë„       2005       2010       2015
ë„ì‹œ
ë¶€ì‚°  3512547.0  3393191.0  3448737.0
ì„œìš¸  9762546.0  9631482.0  9904312.0
ì¸ì²œ        NaN   263203.0  2890451.0

ì•„ë˜ëŠ” ê° ì§€ì—­ë³„ ë„ì‹œì— ëŒ€í•œ ì—°ë„ë³„ ì¸êµ¬ ìˆ˜ë¥¼ êµ¬í•˜ëŠ” ì˜ˆì œì´ë‹¤.

In [5]:
pd.pivot_table(df1, index=['ì§€ì—­', 'ë„ì‹œ'], columns='ì—°ë„', values='ì¸êµ¬')

ì—°ë„           2005       2010       2015
ì§€ì—­  ë„ì‹œ
ê²½ìƒê¶Œ ë¶€ì‚°  3512547.0  3393191.0  3448737.0
ìˆ˜ë„ê¶Œ ì„œìš¸  9762546.0  9631482.0  9904312.0
    ì¸ì²œ        NaN   263203.0  2890451.0

In [6]:
df2 = sns.load_dataset('titanic')[['age', 'sex', 'class', 'fare', 'survived']]
df2.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

ì•„ë˜ëŠ” ê° ì„ ì‹¤ ë“±ê¸‰ë³„ë¡œ ìˆ™ë°•ê°ì˜ ì„±ë³„ë³„ ë‚˜ì´ì˜ í‰ê· ì„ êµ¬í•˜ëŠ” ì˜ˆì œì´ë‹¤.

In [7]:
pd.pivot_table(df2,
               index='class',
               columns='sex',
               values='age',
               aggfunc='mean')

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

ì•„ë˜ëŠ” ê° ì„ ì‹¤ ë“±ê¸‰ë³„ë¡œ ìˆ™ë°•ê°ì˜ ì„±ë³„ë³„ ë‚˜ì´ì˜ í‰ê· ê³¼ í•©ê³„ë¥¼ êµ¬í•˜ëŠ” ì˜ˆì œì´ë‹¤.

In [8]:
pd.pivot_table(df2,
               index='class',
               columns='sex',
               values='age',
               aggfunc=['mean', 'sum'])

             mean                sum
sex        female       male  female     male
class
First   34.611765  41.281386  2942.0  4169.42
Second  28.722973  30.740707  2125.5  3043.33
Third   21.750000  26.507589  2218.5  6706.42

ì•„ë˜ëŠ” ì„ ì‹¤ ë“±ê¸‰, ì„±ë³„, ìƒì¡´ì—¬ë¶€ë³„ ë‚˜ì´ì™€ í‹°ì¼“ê°’ì˜ í‰ê· , ìµœëŒ€ê°’ì„ êµ¬í•˜ëŠ” ì˜ˆì œì´ë‹¤.

In [9]:
pd.pivot_table(df2,
               index=['class', 'sex'],
               columns='survived',
               values=['age', 'fare'],
               aggfunc=['mean', 'max'])

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958

---

## ğŸ“‚ ê·¸ë£¹ ë¶„ì„

ë§Œì•½ í‚¤ê°€ ì§€ì •í•˜ëŠ” ì¡°ê±´ì— ë§ëŠ” ë°ì´í„°ê°€ í•˜ë‚˜ ì´ìƒì´ë¼ì„œ ë°ì´í„° ê·¸ë£¹ì„ ì´ë£¨ëŠ” ê²½ìš°ì—ëŠ” ê·¸ë£¹ì˜ íŠ¹ì„±ì„ ë³´ì—¬ì£¼ëŠ” ê·¸ë£¹ë¶„ì„ì„ í•´ì•¼ í•œë‹¤.<br>
ê·¸ë£¹ ë¶„ì„ì€ Pivot Tableê³¼ ë‹¬ë¦¬ í‚¤ì— ì˜í•´ì„œ ê²°ì •ë˜ëŠ” ë°ì´í„°ê°€ ì—¬ëŸ¬ê°œ ìˆì„ ê²½ìš° ë¯¸ë¦¬ ì§€ì •í•œ ì—°ì‚°ì„ í†µí•´ ê·¸ ê·¸ë£¹ ë°ì´í„°ì˜ ëŒ€í‘œê°’ì„ ê³„ì‚°í•˜ëŠ” ê²ƒì´ë‹¤.

In [10]:
np.random.seed(0)
df3 = pd.DataFrame({
    'key1': ['A', 'A', 'B', 'B', 'A'],
    'key2': ['one', 'two', 'one', 'two', 'one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df3

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

ìš°ì„  ë¶„ì„í•˜ê³ ì í•˜ëŠ” ì‹œë¦¬ì¦ˆë‚˜ ë°ì´í„°í”„ë ˆì„ì— groupby ë©”ì„œë“œë¥¼ í˜¸ì¶œí•˜ì—¬ ê·¸ë£¹í™” ìˆ˜í–‰í•œë‹¤.

In [11]:
groups = df3.groupby(df3.key1)
groups

In [12]:
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [13]:
pd.DataFrame(groups)

   0                                                  1
0  A    key1 key2  data1  data2
0    A  one      1  ...
1  B    key1 key2  data1  data2
2    B  one      3  ...

In [14]:
pd.DataFrame(groups).loc[0].values

array(['A',   key1 key2  data1  data2
            0    A  one      1     10
            1    A  two      2     20
            4    A  one      5     50], dtype=object)

In [15]:
pd.DataFrame(groups).loc[1].values

array(['B',   key1 key2  data1  data2
            2    B  one      3     30
            3    B  two      4     40], dtype=object)

ëŒ€í‘œì ì¸ ê·¸ë£¹ ì—°ì‚° í•¨ìˆ˜ì˜ ì¢…ë¥˜ëŠ” ì•„ë˜ì™€ ê°™ë‹¤.
- size, count : ê·¸ë£¹ ë°ì´í„°ì˜ ê°œìˆ˜
- mean, median, min, max: ê·¸ë£¹ ë°ì´í„°ì˜ í‰ê· , ì¤‘ì•™ê°’, ìµœì†Œ, ìµœëŒ€
- sum, prod, std, var, quantile : ê·¸ë£¹ ë°ì´í„°ì˜ í•©ê³„, ê³±, í‘œì¤€í¸ì°¨, ë¶„ì‚°, ì‚¬ë¶„ìœ„ìˆ˜
- first, last: ê·¸ë£¹ ë°ì´í„° ì¤‘ ì²« ë²ˆì§¸ ë°ì´í„°ì™€ ë§ˆì§€ë§‰ ë°ì´í„°
- describe : ëŒ€í‘œì ì¸ í†µê³„ì¹˜ ê³„ì‚°

ì•„ë˜ì™€ ê°™ì´ ê·¸ë£¹ ê°ì²´ì— ëŒ€í•´ ê·¸ë£¹ ì—°ì‚°ì„ ìˆ˜í–‰í•œë‹¤.

In [16]:
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [17]:
groups['data1'].sum()
groups.sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

key1
A    8
B    7
Name: data1, dtype: int64

In [18]:
groups[['data1']].sum()
groups.sum()[['data1']]

      data1
key1
A         8
B         7

      data1
key1
A         8
B         7

agg(), apply()ëŠ” ì›í•˜ëŠ” ê·¸ë£¹ ì—°ì‚°ì´ ì—†ëŠ” ê²½ìš° ì‚¬ìš©ì ì •ì˜ í•¨ìˆ˜ë¥¼ ê·¸ë£¹ ê°ì²´ì— ì ìš©í•  ìˆ˜ ìˆë„ë¡ í•˜ëŠ” í•¨ìˆ˜ì´ë‹¤.

In [19]:
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [20]:
i_groups = iris.groupby(iris.species)

In [21]:
i_groups.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             250.3        171.4          73.1         12.3
versicolor         296.8        138.5         213.0         66.3
virginica          329.4        148.7         277.6        101.3

In [22]:
def peak_to_peak_ratio(x):
    return x.max() / x.min()

In [23]:
i_groups.agg(peak_to_peak_ratio)

            sepal_length  sepal_width  petal_length  petal_width
species
setosa          1.348837     1.913043      1.900000     6.000000
versicolor      1.428571     1.700000      1.700000     1.800000
virginica       1.612245     1.727273      1.533333     1.785714

In [24]:
def top3_petal_length(df):
    return df.sort_values(by='petal_length', ascending=False)[:3]

In [25]:
i_groups.apply(top3_petal_length)

                sepal_length  sepal_width  petal_length  petal_width  \
species
setosa     24            4.8          3.4           1.9          0.2
           44            5.1          3.8           1.9          0.4
           23            5.1          3.3           1.7          0.5
versicolor 83            6.0          2.7           5.1          1.6
           77            6.7          3.0           5.0          1.7
           72            6.3          2.5           4.9          1.5
virginica  118           7.7          2.6           6.9          2.3
           117           7.7          3.8           6.7          2.2
           122           7.7          2.8           6.7          2.0

                   species
species
setosa     24       setosa
           44       setosa
           23       setosa
versicolor 83   versicolor
           77   versicolor
           72   versicolor
virginica  118   virginica
           117   virginica
           122   virginica

ì•„ë˜ëŠ” speciesë¡œ ë¶„ë¥˜ëœ ê° ê·¸ë£¹ì— ëŒ€í•´ petal_lengthë¥¼ ì†Œ, ì¤‘, ëŒ€ 3 êµ¬ê°„ìœ¼ë¡œ ë¶„ë¥˜í•œ ì˜ˆì œì´ë‹¤.

In [26]:
def q3cut(s):
    return pd.qcut(s, 3, labels=['ì†Œ', 'ì¤‘', 'ëŒ€']).astype(str)

In [27]:
iris.groupby(iris.species).petal_length.apply(q3cut)

0      ì†Œ
1      ì†Œ
2      ì†Œ
3      ì¤‘
4      ì†Œ
      ..
145    ì†Œ
146    ì†Œ
147    ì†Œ
148    ì¤‘
149    ì†Œ
Name: petal_length, Length: 150, dtype: object

In [28]:
iris['petal_length_class'] = iris.groupby(iris.species).petal_length.apply(q3cut)
iris

,sepal_length,sepal_width,petal_length,petal_width,species,petal_length_class
0,5.1,3.5,1.4,0.2,setosa,ì†Œ
1,4.9,3.0,1.4,0.2,setosa,ì†Œ
2,4.7,3.2,1.3,0.2,setosa,ì†Œ
3,4.6,3.1,1.5,0.2,setosa,ì¤‘
4,5.0,3.6,1.4,0.2,setosa,ì†Œ
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,ì†Œ
146,6.3,2.5,5.0,1.9,virginica,ì†Œ
147,6.5,3.0,5.2,2.0,virginica,ì†Œ
148,6.2,3.4,5.4,2.3,virginica,ì¤‘
149,5.9,3.0,5.1,1.8,virginica,ì†Œ

---

## ğŸ“‚ Pivot Table Â· ê·¸ë£¹ í•¨ìˆ˜ ì˜ˆì œ

In [29]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [30]:
tips['tip_pt'] = tips['tip'] / tips['total_bill']
tips

     total_bill   tip     sex smoker   day    time  size    tip_pt
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
..          ...   ...     ...    ...   ...     ...   ...       ...
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [31]:
tips.groupby(['sex', 'smoker']).size() # í¡ì—° ìœ ë¬´ì— ë”°ë¥¸ ì„±ë³„ë³„ ì¸ì›

sex     smoker
Male    Yes       60
        No        97
Female  Yes       33
        No        54
dtype: int64

In [32]:
tips.groupby('sex')['tip_pt'].mean() # ì—¬ì„±ì´ ì‹ì‚¬ ê¸ˆì•¡ ëŒ€ë¹„ íŒì˜ ë¹„ìœ¨ì´ ë” ë†’ë‹¤

sex
Male      0.157651
Female    0.166491
Name: tip_pt, dtype: float64

In [33]:
tips.groupby('smoker')['tip_pt'].mean() # í¡ì—° ìœ ë¬´ì— ë”°ë¥¸ íŒ ë¹„ìœ¨ì˜ í‰ê·

smoker
Yes    0.163196
No     0.159328
Name: tip_pt, dtype: float64

In [34]:
tips.pivot_table('tip_pt',index='sex', columns='smoker') # í¡ì—°ìê°€ ë¹„í¡ì—°ìì— ë¹„í•´ íŒ ë¹„ìœ¨ì´ ë†’ë‹¤

smoker       Yes        No
sex
Male    0.152771  0.160669
Female  0.182150  0.156921

In [35]:
tips.groupby(['sex', 'smoker'])[['tip_pt']].describe() # ì—¬ì„±ì´ë©´ì„œ í¡ì—°ìê°€ íŒ ë¹„ìœ¨ì´ ê°€ì¥ ë†’ë‹¤

              tip_pt                                                    \
               count      mean       std       min       25%       50%
sex    smoker
Male   Yes      60.0  0.152771  0.090588  0.035638  0.101845  0.141015
       No       97.0  0.160669  0.041849  0.071804  0.131810  0.157604
Female Yes      33.0  0.182150  0.071595  0.056433  0.152439  0.173913
       No       54.0  0.156921  0.036421  0.056797  0.139708  0.149691


                    75%       max
sex    smoker
Male   Yes     0.191697  0.710345
       No      0.186220  0.291990
Female Yes     0.198216  0.416667
       No      0.181630  0.252672